https://www.kaggle.com/datasets/imtkaggleteam/global-education?select=3-+number-of-out-of-school-children.csv

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
df1 = pd.read_csv("datasets/1- share-of-the-world-population-with-at-least-basic-education.csv")
df1

,Entity,Code,Year,"Share of population with no formal education, 1820-2020","Share of population with some formal education, 1820-2020"
0,Albania,ALB,2015,2.0,98.0
1,Albania,ALB,2020,1.0,99.0
2,Algeria,DZA,2015,16.0,84.0
3,Algeria,DZA,2020,13.0,87.0
4,Argentina,ARG,2015,2.0,98.0
...,...,...,...,...,...
463,World,OWID_WRL,2020,13.0,87.0
464,Zambia,ZMB,2015,6.0,94.0
465,Zambia,ZMB,2020,5.0,95.0
466,Zimbabwe,ZWE,2015,4.0,96.0
467,Zimbabwe,ZWE,2020,3.0,97.0

In [6]:
df2 = pd.read_csv("datasets/2- learning-adjusted-years-of-school-lays.csv")
df2

          Entity Code  Year  Learning-Adjusted Years of School
0    Afghanistan  AFG  2017                           4.870000
1    Afghanistan  AFG  2018                           4.949788
2    Afghanistan  AFG  2020                           5.052838
3         Africa  NaN  2017                           4.931378
4         Africa  NaN  2018                           5.123904
..           ...  ...   ...                                ...
632       Zambia  ZMB  2020                           5.036293
633     Zimbabwe  ZWE  2010                           6.835774
634     Zimbabwe  ZWE  2017                           6.350000
635     Zimbabwe  ZWE  2018                           7.006610
636     Zimbabwe  ZWE  2020                           7.006610

[637 rows x 4 columns]

In [8]:
df3 = pd.read_csv("datasets/3- number-of-out-of-school-children.csv")
df3

,Entity,Code,Year,"Out-of-school children, adolescents and youth of primary and secondary school age, male (number)","Out-of-school children, adolescents and youth of primary and secondary school age, female (number)"
0,Albania,ALB,2000,78614.0,81341.0
1,Albania,ALB,2001,77837.0,78849.0
2,Albania,ALB,2013,27879.0,21727.0
3,Albania,ALB,2014,21542.0,16571.0
4,Albania,ALB,2015,18407.0,13250.0
...,...,...,...,...,...
2575,Zimbabwe,ZWE,2001,386981.0,474012.0
2576,Zimbabwe,ZWE,2002,462514.0,550123.0
2577,Zimbabwe,ZWE,2003,522317.0,600606.0
2578,Zimbabwe,ZWE,2012,284958.0,333954.0
2579,Zimbabwe,ZWE,2013,277406.0,320425.0

In [9]:
df4 = pd.read_csv("datasets/4- gender-gap-education-levels.csv")
df4

,Entity,Code,Year,"Combined gross enrolment ratio for tertiary education, female","Combined gross enrolment ratio for tertiary education, male","Combined total net enrolment rate, secondary, male","Combined total net enrolment rate, secondary, female","Combined total net enrolment rate, primary, female","Combined total net enrolment rate, primary, male"
0,Afghanistan,AFG,1986,0.62182,3.60227,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,1990,1.40606,2.96306,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,2003,0.51657,1.82170,NaN,NaN,NaN,NaN
3,Afghanistan,AFG,2004,0.51396,1.82145,NaN,NaN,NaN,NaN
4,Afghanistan,AFG,2009,1.41213,5.97378,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
9223,Zimbabwe,ZWE,2000,NaN,NaN,44.75129,40.17528,89.00224,88.52073
9224,Zimbabwe,ZWE,2001,NaN,NaN,45.72983,40.98154,92.54698,91.74628
9225,Zimbabwe,ZWE,2002,NaN,NaN,43.78683,38.72148,89.90188,89.31955
9226,Zimbabwe,ZWE,2003,NaN,NaN,39.19233,35.34257,89.42919,88.45444
9227,Zimbabwe,ZWE,1998,NaN,NaN,NaN,NaN,85.61508,83.42723